unsi9ned/Arduino_Core_Milandr/variants/MDR32FxQI/MDR1211FI/variant_K1986BE92FI_Mini.c
/*
 * Arduino Core for Milandr MCUs
 * Copyright (c) 2026 Andrey Osipov
 *
 * This file is part of Arduino_Core_Milandr.
 * Project home: https://github.com/unsi9ned/Arduino_Core_Milandr
 * Author's website: https://hamlab.net
 *
 * This library is free software; you can redistribute it and/or
 * modify it under the terms of the GNU Lesser General Public
 * License as published by the Free Software Foundation; either
 * version 2.1 of the License, or (at your option) any later version.
 *
 * This library is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * Lesser General Public License for more details.
 *
 * You should have received a copy of the GNU Lesser General Public
 * License along with this library; if not, write to the Free Software
 * Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA
 */

#include "system_K1986VE9xI.h"
#include "MDR32FxQI_rst_clk.h"
#include "MDR32FxQI_bkp.h"
#include "MDR32FxQI_eeprom.h"
#include "variant_K1986BE92FI_Mini.h"
#include "milandr/pin_names.h"
#include "milandr/periph_definition.h"

/*---------------------K1986BE92FI_Mini pins number-----------------------------

          PWM8                       PWM7  PWM6  PWM5              PWM4
           |                          |     |     |                 |
           | P37      P35   P33   P31 | P29 | P27 | P25   P23   P21 |
          P38 | P36    | P34 | P32 | P30 | P28 | P26 | P24 | P22 | P20
           |  |  |     |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |
     G 5V F6 F5 F4 WP F3 F2 F1 F0 A0 A1 A2 A3 A4 A5 A6 A7 B10B9 B8 B7 3V3 G
     |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |
   +------------------------------------------------------------------------+
   |                                                                        |
  ┌-----┐                                                                   |+-- G
  | USB |                                                                   |+-- D1--49--P40--AN7
  └-----┘                                                                   |+-- D0--48--P39--AN6
   |                                                                        |+-- 3V
   +------------------------------------------------------------------------+
     |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |
    VB  R E3 E2 E1 E0 D7 D4 D2 D3 D5 D6 C2 C1 C0 B0 B1 B2 B3 B4 B5 B6 3V3 G
           |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |
          P0 P1 P2 P3 P4 P5 P6 P7 P8 P9 P10 | P12 | P14 | P16 | P18 |
              |        |  |  |  |  |  |  | P11   P13   P15   P17 | P19
              |       AN0 | AN2 | AN4 |  |              |        |
              |          AN1   AN3   AN5 |              |        |
             PWM0                       PWM1           PWM2     PWM3

------------------------------------------------------------------------------*/

//------------------------------------------------------------------------------
// Константы
//------------------------------------------------------------------------------
#define HSI_FREQ_HZ       8000000UL
#define HSE_FREQ_HZ       8000000UL
#define LSE_FREQ_HZ       32768UL
#define LSI_FREQ_HZ       40000UL

//------------------------------------------------------------------------------
// Глобальные переменные, которые должны быть заданы в variant.h
//------------------------------------------------------------------------------


//------------------------------------------------------------------------------
// Полная таблица пинов с их функциональным назначением
// Примеры:
//    1) Быстрый доступ к связке MDR_PORTx/PORT_Pin_y:
//       pinTable[D0][PIN_MODE_GPIO].pinName + битовые операции
//    2) Определение номера периферии пина MOSI = D5
//       pinTable[D5][PIN_MODE_ALTER].periphN или
//       pinTable[D5][PIN_MODE_OVERRID].periphN
// Примечание:
//    1) Eсли номер periphN = 0, то модуль в единственном эксземпляре и не нумеруется
//    2) Если pinTable[D5][PIN_MODE_ANALOG].periph = PERIPH_PORT, то пин не имеет аналоговой функции
//------------------------------------------------------------------------------
const tMilandrPin pinTable[DMAX][PIN_MUX_LINES_NUM][1] =
{
	[D0] =
	{
		[PIN_MUX_GPIO] = {{.pinName = PE_3, .pinFunc = PIN_MUX_GPIO, .periph = PERIPH_PORT, .periphN = 0, .periphLine = DIO_LINE}},
		[PIN_MUX_MAIN] = {{.pinName = PE_3, .pinFunc = PIN_MUX_MAIN, .periph = PERIPH_PORT, .periphN = 0, .periphLine = DIO_LINE}},
		[PIN_MUX_ALTER] = {{.pinName = PE_3, .pinFunc = PIN_MUX_ALTER, .periph = PERIPH_TIMER, .periphN = TIMER_2, .periphLine = TMR_CH3_N_LINE}},
		[PIN_MUX_OVERRID] = {{.pinName = PE_3, .pinFunc = PIN_MUX_OVERRID, .periph = PERIPH_TIMER, .periphN = TIMER_3, .periphLine = TMR_CH1_N_LINE}},
		[PIN_MUX_ANALOG] = {{.pinName = PE_3, .pinFunc = PIN_MUX_ANALOG, .periph = PERIPH_COMP, .periphN = 0, .periphLine = COMP_IN2_LINE}},
	},

	[D1] =
	{
		[PIN_MUX_GPIO] = {{.pinName = PE_2, .pinFunc = PIN_MUX_GPIO, .periph = PERIPH_PORT, .periphN = 0, .periphLine = DIO_LINE}},
		[PIN_MUX_MAIN] = {{.pinName = PE_2, .pinFunc = PIN_MUX_MAIN, .periph = PERIPH_PORT, .periphN = 0, .periphLine = DIO_LINE}},
		[PIN_MUX_ALTER] = {{.pinName = PE_2, .pinFunc = PIN_MUX_ALTER, .periph = PERIPH_PWM, .periphN = TIMER_2, .periphLine = TMR_CH3_LINE}},
		[PIN_MUX_OVERRID] = {{.pinName = PE_2, .pinFunc = PIN_MUX_OVERRID, .periph = PERIPH_TIMER, .periphN = TIMER_3, .periphLine = TMR_CH1_LINE}},
		[PIN_MUX_ANALOG] = {{.pinName = PE_2, .pinFunc = PIN_MUX_ANALOG, .periph = PERIPH_COMP, .periphN = 0, .periphLine = COMP_IN1_LINE}},
	},

	//...
	[D6] =
	{
		[PIN_MUX_GPIO] = {{.pinName = PD_2, .pinFunc = PIN_MUX_GPIO, .periph = PERIPH_PORT, .periphN = 0, .periphLine = DIO_LINE}},
		[PIN_MUX_MAIN] = {{.pinName = PD_2, .pinFunc = PIN_MUX_MAIN, .periph = PERIPH_PORT, .periphN = 0, .periphLine = DIO_LINE}},
		[PIN_MUX_ALTER] = {{.pinName = PD_2, .pinFunc = PIN_MUX_ALTER, .periph = PERIPH_SSP, .periphN = SSP_2, .periphLine = SSP_RXD_LINE}},
		[PIN_MUX_OVERRID] = {{.pinName = PD_2, .pinFunc = PIN_MUX_OVERRID, .periph = PERIPH_TIMER, .periphN = TIMER_3, .periphLine = TMR_CH2_LINE}},
		[PIN_MUX_ANALOG] = {{.pinName = PD_2, .pinFunc = PIN_MUX_ANALOG, .periph = PERIPH_ADC, .periphN = ADC_2, .periphLine = ADC_IN_LINE}},
	},

	[D7] =
	{
		[PIN_MUX_GPIO] = {{.pinName = PD_3, .pinFunc = PIN_MUX_GPIO, .periph = PERIPH_PORT, .periphN = 0, .periphLine = DIO_LINE}},
		[PIN_MUX_MAIN] = {{.pinName = PD_3, .pinFunc = PIN_MUX_MAIN, .periph = PERIPH_PORT, .periphN = 0, .periphLine = DIO_LINE}},
		[PIN_MUX_ALTER] = {{.pinName = PD_3, .pinFunc = PIN_MUX_ALTER, .periph = PERIPH_SSP, .periphN = SSP_2, .periphLine = SSP_FSS_LINE}},
		[PIN_MUX_OVERRID] = {{.pinName = PD_3, .pinFunc = PIN_MUX_OVERRID, .periph = PERIPH_TIMER, .periphN = TIMER_3, .periphLine = TMR_CH2_N_LINE}},
		[PIN_MUX_ANALOG] = {{.pinName = PD_3, .pinFunc = PIN_MUX_ANALOG, .periph = PERIPH_ADC, .periphN = ADC_3, .periphLine = ADC_IN_LINE}},
	},

