unsi9ned/Arduino_Core_Milandr/variants/MDR32FxQI/MDR1211FI/variant_K1986BE92FI_Mini.c
	[D25] =
	{
		[PIN_MUX_GPIO] = {{.pinName = PA_6, .pinFunc = PIN_MUX_GPIO, .periph = PERIPH_PORT, .periphN = 0, .periphLine = DIO_LINE}},
		[PIN_MUX_MAIN] = {{.pinName = PA_6, .pinFunc = PIN_MUX_MAIN, .periph = PERIPH_PORT, .periphN = 0, .periphLine = DIO_LINE}},
		[PIN_MUX_ALTER] = {{.pinName = PA_6, .pinFunc = PIN_MUX_ALTER, .periph = PERIPH_CAN, .periphN = CAN_1, .periphLine = CAN_TXD_LINE}},
		[PIN_MUX_OVERRID] = {{.pinName = PA_6, .pinFunc = PIN_MUX_OVERRID, .periph = PERIPH_UART, .periphN = UART_1, .periphLine = UART_RXD_LINE}},
		[PIN_MUX_ANALOG] = {{.pinName = PA_6, .pinFunc = PIN_MUX_ANALOG, .periph = PERIPH_PORT, .periphN = 0, .periphLine = DIO_LINE}},
	},

	[D26] =
	{
		[PIN_MUX_GPIO] = {{.pinName = PA_5, .pinFunc = PIN_MUX_GPIO, .periph = PERIPH_PORT, .periphN = 0, .periphLine = DIO_LINE}},
		[PIN_MUX_MAIN] = {{.pinName = PA_5, .pinFunc = PIN_MUX_MAIN, .periph = PERIPH_PORT, .periphN = 0, .periphLine = DIO_LINE}},
		[PIN_MUX_ALTER] = {{.pinName = PA_5, .pinFunc = PIN_MUX_ALTER, .periph = PERIPH_PWM, .periphN = TIMER_1, .periphLine = TMR_CH3_LINE}},
		[PIN_MUX_OVERRID] = {{.pinName = PA_5, .pinFunc = PIN_MUX_OVERRID, .periph = PERIPH_TIMER, .periphN = TIMER_2, .periphLine = TMR_CH3_LINE}},
		[PIN_MUX_ANALOG] = {{.pinName = PA_5, .pinFunc = PIN_MUX_ANALOG, .periph = PERIPH_PORT, .periphN = 0, .periphLine = DIO_LINE}},
	},

	[D27] =
	{
		[PIN_MUX_GPIO] = {{.pinName = PA_4, .pinFunc = PIN_MUX_GPIO, .periph = PERIPH_PORT, .periphN = 0, .periphLine = DIO_LINE}},
		[PIN_MUX_MAIN] = {{.pinName = PA_4, .pinFunc = PIN_MUX_MAIN, .periph = PERIPH_PORT, .periphN = 0, .periphLine = DIO_LINE}},
		[PIN_MUX_ALTER] = {{.pinName = PA_4, .pinFunc = PIN_MUX_ALTER, .periph = PERIPH_TIMER, .periphN = TIMER_1, .periphLine = TMR_CH2_N_LINE}},
		[PIN_MUX_OVERRID] = {{.pinName = PA_4, .pinFunc = PIN_MUX_OVERRID, .periph = PERIPH_TIMER, .periphN = TIMER_2, .periphLine = TMR_CH2_N_LINE}},
		[PIN_MUX_ANALOG] = {{.pinName = PA_4, .pinFunc = PIN_MUX_ANALOG, .periph = PERIPH_PORT, .periphN = 0, .periphLine = DIO_LINE}},
	},

	[D28] =
	{
		[PIN_MUX_GPIO] = {{.pinName = PA_3, .pinFunc = PIN_MUX_GPIO, .periph = PERIPH_PORT, .periphN = 0, .periphLine = DIO_LINE}},
		[PIN_MUX_MAIN] = {{.pinName = PA_3, .pinFunc = PIN_MUX_MAIN, .periph = PERIPH_PORT, .periphN = 0, .periphLine = DIO_LINE}},
		[PIN_MUX_ALTER] = {{.pinName = PA_3, .pinFunc = PIN_MUX_ALTER, .periph = PERIPH_PWM, .periphN = TIMER_1, .periphLine = TMR_CH2_LINE}},
		[PIN_MUX_OVERRID] = {{.pinName = PA_3, .pinFunc = PIN_MUX_OVERRID, .periph = PERIPH_TIMER, .periphN = TIMER_2, .periphLine = TMR_CH2_LINE}},
		[PIN_MUX_ANALOG] = {{.pinName = PA_3, .pinFunc = PIN_MUX_ANALOG, .periph = PERIPH_PORT, .periphN = 0, .periphLine = DIO_LINE}},
	},

	[D29] =
	{
		[PIN_MUX_GPIO] = {{.pinName = PA_2, .pinFunc = PIN_MUX_GPIO, .periph = PERIPH_PORT, .periphN = 0, .periphLine = DIO_LINE}},
		[PIN_MUX_MAIN] = {{.pinName = PA_2, .pinFunc = PIN_MUX_MAIN, .periph = PERIPH_PORT, .periphN = 0, .periphLine = DIO_LINE}},
		[PIN_MUX_ALTER] = {{.pinName = PA_2, .pinFunc = PIN_MUX_ALTER, .periph = PERIPH_TIMER, .periphN = TIMER_1, .periphLine = TMR_CH1_N_LINE}},
		[PIN_MUX_OVERRID] = {{.pinName = PA_2, .pinFunc = PIN_MUX_OVERRID, .periph = PERIPH_TIMER, .periphN = TIMER_2, .periphLine = TMR_CH1_N_LINE}},
		[PIN_MUX_ANALOG] = {{.pinName = PA_2, .pinFunc = PIN_MUX_ANALOG, .periph = PERIPH_PORT, .periphN = 0, .periphLine = DIO_LINE}},
	},

	[D30] =
	{
		[PIN_MUX_GPIO] = {{.pinName = PA_1, .pinFunc = PIN_MUX_GPIO, .periph = PERIPH_PORT, .periphN = 0, .periphLine = DIO_LINE}},
		[PIN_MUX_MAIN] = {{.pinName = PA_1, .pinFunc = PIN_MUX_MAIN, .periph = PERIPH_PORT, .periphN = 0, .periphLine = DIO_LINE}},
		[PIN_MUX_ALTER] = {{.pinName = PA_1, .pinFunc = PIN_MUX_ALTER, .periph = PERIPH_TIMER, .periphN = TIMER_1, .periphLine = TMR_CH1_LINE}},
		[PIN_MUX_OVERRID] = {{.pinName = PA_1, .pinFunc = PIN_MUX_OVERRID, .periph = PERIPH_PWM, .periphN = TIMER_2, .periphLine = TMR_CH1_LINE}},
		[PIN_MUX_ANALOG] = {{.pinName = PA_1, .pinFunc = PIN_MUX_ANALOG, .periph = PERIPH_PORT, .periphN = 0, .periphLine = DIO_LINE}},
	},

	// ...

	[D32] =
	{
		[PIN_MUX_GPIO] = {{.pinName = PF_0, .pinFunc = PIN_MUX_GPIO, .periph = PERIPH_PORT, .periphN = 0, .periphLine = DIO_LINE}},
		[PIN_MUX_MAIN] = {{.pinName = PF_0, .pinFunc = PIN_MUX_MAIN, .periph = PERIPH_PORT, .periphN = 0, .periphLine = DIO_LINE}},
		[PIN_MUX_ALTER] = {{.pinName = PF_0, .pinFunc = PIN_MUX_ALTER, .periph = PERIPH_SSP, .periphN = SSP_1, .periphLine = SSP_TXD_LINE}},
		[PIN_MUX_OVERRID] = {{.pinName = PF_0, .pinFunc = PIN_MUX_OVERRID, .periph = PERIPH_UART, .periphN = UART_2, .periphLine = UART_RXD_LINE}},
		[PIN_MUX_ANALOG] = {{.pinName = PF_0, .pinFunc = PIN_MUX_ANALOG, .periph = PERIPH_PORT, .periphN = 0, .periphLine = DIO_LINE}},
	},

	[D33] =
	{
		[PIN_MUX_GPIO] = {{.pinName = PF_1, .pinFunc = PIN_MUX_GPIO, .periph = PERIPH_PORT, .periphN = 0, .periphLine = DIO_LINE}},
		[PIN_MUX_MAIN] = {{.pinName = PF_1, .pinFunc = PIN_MUX_MAIN, .periph = PERIPH_PORT, .periphN = 0, .periphLine = DIO_LINE}},
		[PIN_MUX_ALTER] = {{.pinName = PF_1, .pinFunc = PIN_MUX_ALTER, .periph = PERIPH_SSP, .periphN = SSP_1, .periphLine = SSP_CLK_LINE}},
		[PIN_MUX_OVERRID] = {{.pinName = PF_1, .pinFunc = PIN_MUX_OVERRID, .periph = PERIPH_UART, .periphN = UART_2, .periphLine = UART_TXD_LINE}},
		[PIN_MUX_ANALOG] = {{.pinName = PF_1, .pinFunc = PIN_MUX_ANALOG, .periph = PERIPH_PORT, .periphN = 0, .periphLine = DIO_LINE}},
	},

	[D34] =
	{
		[PIN_MUX_GPIO] = {{.pinName = PF_2, .pinFunc = PIN_MUX_GPIO, .periph = PERIPH_PORT, .periphN = 0, .periphLine = DIO_LINE}},
		[PIN_MUX_MAIN] = {{.pinName = PF_2, .pinFunc = PIN_MUX_MAIN, .periph = PERIPH_PORT, .periphN = 0, .periphLine = DIO_LINE}},
		[PIN_MUX_ALTER] = {{.pinName = PF_2, .pinFunc = PIN_MUX_ALTER, .periph = PERIPH_SSP, .periphN = SSP_1, .periphLine = SSP_FSS_LINE}},
		[PIN_MUX_OVERRID] = {{.pinName = PF_2, .pinFunc = PIN_MUX_OVERRID, .periph = PERIPH_CAN, .periphN = CAN_2, .periphLine = CAN_RXD_LINE}},
		[PIN_MUX_ANALOG] = {{.pinName = PF_2, .pinFunc = PIN_MUX_ANALOG, .periph = PERIPH_PORT, .periphN = 0, .periphLine = DIO_LINE}},
	},

