unsi9ned/Arduino_Core_Milandr/variants/MDR32FxQI/MDR1211FI/variant_K1986BE92FI_Mini.c
	[D35] =
	{
		[PIN_MUX_GPIO] = {{.pinName = PF_3, .pinFunc = PIN_MUX_GPIO, .periph = PERIPH_PORT, .periphN = 0, .periphLine = DIO_LINE}},
		[PIN_MUX_MAIN] = {{.pinName = PF_3, .pinFunc = PIN_MUX_MAIN, .periph = PERIPH_PORT, .periphN = 0, .periphLine = DIO_LINE}},
		[PIN_MUX_ALTER] = {{.pinName = PF_3, .pinFunc = PIN_MUX_ALTER, .periph = PERIPH_SSP, .periphN = SSP_1, .periphLine = SSP_RXD_LINE}},
		[PIN_MUX_OVERRID] = {{.pinName = PF_3, .pinFunc = PIN_MUX_OVERRID, .periph = PERIPH_CAN, .periphN = CAN_2, .periphLine = CAN_TXD_LINE}},
		[PIN_MUX_ANALOG] = {{.pinName = PF_3, .pinFunc = PIN_MUX_ANALOG, .periph = PERIPH_PORT, .periphN = 0, .periphLine = DIO_LINE}},
	},

	// ...

	[D38] =
	{
		[PIN_MUX_GPIO] = {{.pinName = PF_6, .pinFunc = PIN_MUX_GPIO, .periph = PERIPH_PORT, .periphN = 0, .periphLine = DIO_LINE}},
		[PIN_MUX_MAIN] = {{.pinName = PF_6, .pinFunc = PIN_MUX_MAIN, .periph = PERIPH_PORT, .periphN = 0, .periphLine = DIO_LINE}},
		[PIN_MUX_ALTER] = {{.pinName = PF_6, .pinFunc = PIN_MUX_ALTER, .periph = PERIPH_PWM, .periphN = TIMER_1, .periphLine = TMR_CH1_LINE}},
		[PIN_MUX_OVERRID] = {{.pinName = PF_6, .pinFunc = PIN_MUX_OVERRID, .periph = PERIPH_PORT, .periphN = 0, .periphLine = DIO_LINE}},
		[PIN_MUX_ANALOG] = {{.pinName = PF_6, .pinFunc = PIN_MUX_ANALOG, .periph = PERIPH_PORT, .periphN = 0, .periphLine = DIO_LINE}},
	},
};

//------------------------------------------------------------------------------
// Повышение частоты шины HCLK до максимальной 80 МГц (по умолчанию 8 МГц)
//------------------------------------------------------------------------------
void initVariant()
{
	/* Set RST_CLK to default */
	/* Also resets DUcc voltage regulator work mode */
	RST_CLK_DeInit();
	SystemCoreClockUpdate();

	/* Включаем внешний источник тактирования - кварц 8 МГц */
	RST_CLK_HSEconfig(RST_CLK_HSE_ON);

	/* Good HSE clock */
	if (RST_CLK_HSEstatus() == SUCCESS)
	{
		RST_CLK_CPUclkSelectionC1(RST_CLK_CPU_C1srcHSEdiv1);

		/* Select HSE clock as CPU_PLL input clock source */
		/* Set PLL multiplier to 10                       */
		/* Увеличиваем частоту CPU_C1 до 80 МГц           */
		RST_CLK_CPU_PLLconfig(RST_CLK_CPU_PLLsrcHSEdiv1, RST_CLK_CPU_PLLmul10);
	}
	else
	{
		/* Работаем от внутреннего источника тактирования - HSI 8 МГц */
		RST_CLK_HSEconfig(RST_CLK_HSE_OFF);

		/* Select HSI clock as CPU_C1 input clock source */
		RST_CLK_CPUclkSelectionC1(RST_CLK_CPU_C1srcHSIdiv1);

		/* Select HSI clock as CPU_PLL input clock source */
		/* Set PLL multiplier to 10                       */
		/* Увеличиваем частоту CPU_C1 до 80 МГц           */
		RST_CLK_CPU_PLLconfig(RST_CLK_CPU_PLLsrcHSIdiv1, RST_CLK_CPU_PLLmul10);
	}

	/* Enable CPU_PLL */
	RST_CLK_CPU_PLLcmd(ENABLE);

	/* Good CPU PLL */
	if (RST_CLK_CPU_PLLstatus() == SUCCESS)
	{
		/* Set CPU_C3_prescaler to 2 */
		RST_CLK_CPUclkPrescaler(RST_CLK_CPUclkDIV1);
		/* Set CPU_C2_SEL to CPU_PLL output instead of CPU_C1 clock */
		RST_CLK_CPU_PLLuse(ENABLE);

		/* Setup internal DUcc voltage regulator work mode based on clock frequency */
		BKP_DUccMode(BKP_DUcc_upto_80MHz);
		/* Setup EEPROM access delay to 1: 10*HSE/1 = 80MHz > 75MHz */
		EEPROM_SetLatency(EEPROM_Latency_3);

		/* Select CPU_C3 clock on the CPU clock MUX */
		RST_CLK_CPUclkSelection(RST_CLK_CPUclkCPU_C3);
	}
	else
	{
		/* Работаем от внутреннего источника тактирования -
		 * HSI 8 МГц без умножения частоты                */

		/* Enable CPU_PLL */
		RST_CLK_CPU_PLLcmd(DISABLE);

		/* Setup internal DUcc voltage regulator work mode based on clock frequency */
		BKP_DUccMode(BKP_DUcc_upto_10MHz);
		/* Setup EEPROM access delay to 0: HSI = 8MHz < 25MHz */
		EEPROM_SetLatency(EEPROM_Latency_0);

		/* Select HSI clock on the CPU clock MUX */
		RST_CLK_CPUclkSelection(RST_CLK_CPUclkHSI);
	}

	SystemCoreClockUpdate();
}

